{
  "irVersion": "9",
  "producerName": "skl2onnx",
  "producerVersion": "1.16.0",
  "domain": "ai.onnx",
  "modelVersion": "0",
  "docString": "",
  "graph": {
    "node": [
      {
        "input": [
          "X"
        ],
        "output": [
          "cast_input"
        ],
        "name": "Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "11",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "cast_input",
          "coefficient"
        ],
        "output": [
          "mul_result"
        ],
        "name": "MatMul",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result",
          "intercepts"
        ],
        "output": [
          "add_result"
        ],
        "name": "Add",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result"
        ],
        "output": [
          "next_activations"
        ],
        "name": "Relu",
        "opType": "Relu",
        "domain": ""
      },
      {
        "input": [
          "next_activations",
          "coefficient1"
        ],
        "output": [
          "mul_result1"
        ],
        "name": "MatMul1",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result1",
          "intercepts1"
        ],
        "output": [
          "add_result1"
        ],
        "name": "Add1",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result1"
        ],
        "output": [
          "out_activations_result"
        ],
        "name": "Relu1",
        "opType": "Softmax",
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "argmax_output"
        ],
        "name": "ArgMax",
        "opType": "ArgMax",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "output_probability"
        ],
        "name": "ZipMap",
        "opType": "ZipMap",
        "attribute": [
          {
            "name": "classlabels_int64s",
            "ints": [
              "0",
              "1",
              "2",
              "3"
            ],
            "type": "INTS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "classes",
          "argmax_output"
        ],
        "output": [
          "array_feature_extractor_result"
        ],
        "name": "ArrayFeatureExtractor",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "array_feature_extractor_result",
          "shape_tensor"
        ],
        "output": [
          "reshaped_result"
        ],
        "name": "Reshape",
        "opType": "Reshape",
        "domain": ""
      },
      {
        "input": [
          "reshaped_result"
        ],
        "output": [
          "label"
        ],
        "name": "Cast1",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "label"
        ],
        "output": [
          "output_label"
        ],
        "name": "Cast2",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      }
    ],
    "name": "ONNX(MLPClassifier)",
    "initializer": [
      {
        "dims": [
          "5",
          "10"
        ],
        "dataType": 11,
        "name": "coefficient",
        "doubleData": [
          -1.3950881337084666e-05,
          -0.010680505069482397,
          1.587231419879295,
          -0.0002776758086276478,
          1.5692224603963827e-05,
          0.3910850923621324,
          -0.3666683867440008,
          2.1206854646162725e-05,
          0.391360374119892,
          -0.21531834767707733,
          1.4328218752687997e-05,
          1.2830389368951582,
          -0.4885023659940683,
          -0.06405819034605129,
          -1.6071015808873022e-05,
          0.2699450530520445,
          0.24518233985094048,
          -1.4480730915099712e-05,
          0.10313430774119782,
          0.000554119570231841,
          -7.436580092613786e-06,
          0.18808429007472197,
          1.825892076299829,
          -0.00018486493021800942,
          1.5233572926321116e-05,
          0.3203687772941954,
          -1.5490153687491763,
          1.7293129381598976e-05,
          -0.05214982067414266,
          -1.942470777927857,
          -0.00030620497168165324,
          -0.24627121712185346,
          -0.29019005014346533,
          -0.0745643044274285,
          7.204282628275263e-06,
          -1.9206440510368785,
          0.641837401468422,
          -4.265974893931606e-06,
          -0.022259131678843816,
          1.3145248955415685,
          1.044873817527173e-05,
          -0.2590095255491958,
          -0.1694303308384903,
          2.2052938034326623,
          7.85985034990723e-06,
          4.014706611259475,
          -1.3105864263494913,
          -1.2980846189674545e-05,
          -0.9873438377352807,
          -2.0019701499972893
        ]
      },
      {
        "dims": [
          "1",
          "10"
        ],
        "dataType": 11,
        "name": "intercepts",
        "doubleData": [
          -6.3954410066856235,
          -5.844784758146318,
          -6.365593555493467,
          -5.670249782314682,
          -3.589384233796091,
          -20.16272843378766,
          -7.934818874999759,
          -3.0855015057837107,
          -15.453234113017613,
          -6.163917789613218
        ]
      },
      {
        "dims": [
          "10",
          "4"
        ],
        "dataType": 11,
        "name": "coefficient1",
        "doubleData": [
          -2.1069360551124226e-06,
          -9.024906170739127e-06,
          0.000814331329044342,
          1.1367414861591057e-05,
          8.625870233969175e-06,
          0.13637215420375712,
          -0.00024777746228050036,
          -0.017809861921467912,
          -0.1926406377166821,
          2.018283423433763,
          2.200488058100132,
          1.0219769781415464,
          1.5661242818108279,
          -0.15817037758792551,
          -0.22024344567338328,
          0.3236232172988575,
          1.4265013554591145e-05,
          9.424792349733344e-06,
          -1.7740772069828664e-07,
          -2.7818147473867425e-05,
          0.16261352059143858,
          1.6507868452877643,
          -1.9874115997130546,
          0.4041730386829736,
          0.19619551957152168,
          2.401617448231884,
          -1.628969806893133,
          0.10251976134668467,
          8.406881208455175e-05,
          -0.00012089929920311368,
          -1.1809509671105765e-05,
          -7.484860659127255e-06,
          -0.6904761777014531,
          -0.3911039662208572,
          0.010830923288650172,
          0.19501897232366144,
          0.09856365140921419,
          -1.3377157744454151,
          0.26585483462770354,
          0.0005591377401804824
        ]
      },
      {
        "dims": [
          "1",
          "4"
        ],
        "dataType": 11,
        "name": "intercepts1",
        "doubleData": [
          1.8538516620868963,
          1.7224673665762484,
          -1.0296369190955847,
          -1.154402183703043
        ]
      },
      {
        "dims": [
          "4"
        ],
        "dataType": 6,
        "int32Data": [
          0,
          1,
          2,
          3
        ],
        "name": "classes"
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 7,
        "int64Data": [
          "-1"
        ],
        "name": "shape_tensor"
      }
    ],
    "input": [
      {
        "name": "X",
        "type": {
          "tensorType": {
            "elemType": 11,
            "shape": {
              "dim": [
                {},
                {
                  "dimValue": "5"
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "output_label",
        "type": {
          "tensorType": {
            "elemType": 7,
            "shape": {
              "dim": [
                {}
              ]
            }
          }
        }
      },
      {
        "name": "output_probability",
        "type": {
          "sequenceType": {
            "elemType": {
              "mapType": {
                "keyType": 7,
                "valueType": {
                  "tensorType": {
                    "elemType": 11
                  }
                }
              }
            }
          }
        }
      }
    ]
  },
  "opsetImport": [
    {
      "domain": "",
      "version": "19"
    },
    {
      "domain": "ai.onnx.ml",
      "version": "1"
    }
  ]
}